{"data":{"markdownRemark":{"html":"<p>Meanwhile waiting for the 5th release of express(js) let's write an article containing basics of simple yet powerful node server. When it comes to nodeJS, many frameworks have one thing in common - they have express(js) between dependencies. Take a look into Sails, Feathers, or Koa - which is also heavily inspired.</p>\n<p>ExpressJS can be used even for single page app if you are stubborn enough, but its main advance is the simplicity introduced to the backend guys.</p>\n<p>Let's start simple enough to see how fast we can \"hello world response\".</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">mkdir expresstest\ncd expresstest\nnpm init\nnpm i express --save\ntouch index.js</code></pre></div>\n<p>Place inisde the following code taken straight from the docs.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">const express = require(&#39;express&#39;)\nconst app = express()\nconst port = 3000\n\napp.get(&#39;/&#39;, (req, res) =&gt; res.send(&#39;Hello World!&#39;))\n\napp.listen(port, () =&gt; console.log(`Example app listening on port ${port}!`))</code></pre></div>\n<p>Run <code class=\"language-text\">node index.js</code>. It will interpret your js file. Then you can enter <code class=\"language-text\">http://localhost:3000</code> into your browser to see the result immediately. Instead of the hello world, you can send anything else with res object passed into the app's function. The response can be a string, a JSON thing, a file, download prompt, even redirect.</p>\n<p>Saying hello when you use project for the first time is a common path to understand what's going on. But what's coming next? Add the database with mongo, prepare docker compose file to be independent of the environment, make a middleware to protect you \"precious\". And all that, we'll be making in an upcoming part. Can't wait.</p>","fields":{"slug":"/basic-node-server-expressjs/","date":"2019-03-20"},"frontmatter":{"title":"Basic node server, I MEAN expressJS"}}},"pageContext":{"singlePost":true}}